'use strict';

//instance > class > factory > pool

// instance -  это экземпляр лбого ссылочного типа данных - это может быть объект массив или даже функция или элемент массива
//
// Класс / Class - программная абстракция, объединяющая состояние и поведение (свойства и методы) своих экземпляров (инстансов).

// factory фабрика - это функция создающая сразу экземпляр проводя внутри инстанциирование

// pool - пул - это функция которая создает множество экземпляров и которая может их и переиспользовать


